{
  "_name_or_path": "bert-base-cased",
  "_num_labels": 6,
  "architectures": [
    "BertForMaskedLM"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-PII",
    "1": "B-Processing",
    "2": "I-Processing",
    "3": "Subject",
    "4": "O",
    "5": "I-PII"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-PII": 0,
    "B-Processing": 1,
    "I-PII": 5,
    "I-Processing": 2,
    "O": 4,
    "Subject": 3
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.28.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 28996
}
